In [37]:
import sqlalchemy as db
import pandas as pd
engine = create_engine('postgresql://postgres:pear12@localhost:5432/employees')
connection = engine.connect()

metadata = db.MetaData()
salaries = db.Table('salaries', metadata, autoload=True, autoload_with=engine)
salaries

Table('salaries', MetaData(bind=None), Column('emp_no', TEXT(), ForeignKey('employees.emp_no'), table=<salaries>, nullable=False), Column('salary', INTEGER(), table=<salaries>, nullable=False), schema=None)

In [39]:
query = db.select([salaries])
ResultProxy = connection.execute(query)
ResultSet = ResultProxy.fetchall()

df = pd.DataFrame(ResultSet)
df.columns = ResultSet[0].keys()

df

        emp_no  salary
0        10001   60117
1        10002   65828
2        10003   40006
3        10004   40054
4        10005   78228
...        ...     ...
300019  499995   40000
300020  499996   58058
300021  499997   49597
300022  499998   40000
300023  499999   63707

[300024 rows x 2 columns]